import React, { Component } from 'react'
import Loading from '../components/Loading'

export default class About extends Component {
  state={
    loading: true
  }

  componentDidMount(){
    setTimeout(()=>{
      this.setState({
        loading: false
      })
    }, 1000);
  }
  render() {
    if(this.state.loading){
      return (
        <>
        <h3 className="post-category font-weight-light p-3 text-center">Մեր մասին</h3>
        <Loading />
        </>
    )
    }
    else{
      return (
        <div className="container">
            <div className="row">
                <div className="col">
                    <div className="single-post w-75 mx-auto text-center">
                        <h3 className="post-category font-weight-light p-3 text-center">Մեր մասին</h3>
                        <p className="font-weight-normal text-center" style={{lineHeight: "200%"}}>«baghadratomser.com» կայքը ստեղծվել է 2020թ.-ին: Մենք նպատակ ունեինք ստեղծելու մի կայք, որտեղ ոտք դրած յուրաքանչյուր այցելու կգնտի իրեն հարմար ցանկացած բաղադրատոմս և կվայելի ինչպես հայկական, այնպես էլ այլ երկրների բազմատեսակ խոհանոցների անկրկնելի համը։ Յուրահատուկ դիզայնով և հետաքրքիր լուծումներով կայքը օգտվելու ընթացքում այցելուների համար դժվարություններ չի առաջացնում։ Կայքի բաղադրատոմսերը անընդհատ թարմացվում են տարատեսակ բաղադրատոմսերով` հաճախորդներին հրամցնելով հայկական ավանդական խոհանոցի համային անկրկնելի գաղտնիքները: Կայքը նախատեսված է տարբեր տարիքային խմբի մարդկանց համար, քանի որ կայքում ցուցադրված են բաղադրատոմսեր ինչպես մեծահասակների, այնպես էլ երեխաների և դիետիկ սնունդ նախընտրող մարդկանց համար։ Դիետիկ սնունդ նախընտրող մարդիկ լայն հնարավորություն ունեն օգտվելու դիետիկ ուտեստների ու բազմատեսակ աղցանների հարուստ ընտրանուց: Խոհարարական արվեստում համեղ կերակուր ստանալու համար կարևոր է բաղադրատոմսի ճիշտ պահպանումը, բայց կա նաև մի այլ կարևոր հանգամանք, դա յուրաքանչյուր կերակրի պատրաստման հիմքում սիրո ներդրումն է: Թերևս հենց սիրով ու որակով պատրաստելու հանգամանքն է, կերակուրը դարձնում ավելի համեղ և ախորժելի:</p>
                    </div>
                </div>
            </div>
        </div>
      )
    }
  }
}

